#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки номенклатуры на указанную дату по выбранным складам.
//
// Параметры:
//   ДатаАктуальности - Дата - момент времени, для которого определяется остаток
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатурная позиция для проверки остатков
//   Склады - Массив или СписокЗначений - список складов, по которым нужно получить данные
//
// Возвращаемое значение:
//   Структура - соответствие складов и остатков количества (ключ - наименование склада без пробелов, значение - количество)
Функция ОстатокНоменклатуры(ДатаАктуальности, Номенклатура, Склады) Экспорт

	Результат = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыОстатки.Склад КАК Склад,
	|	ТоварыОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(&ДатаАктуальности, Номенклатура = &Ссылка И Склад В (&Склады)) КАК ТоварыОстатки";

	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);

	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("Склады", Склады);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СтрЗаменить(Выборка.Склад, " ", ""), Выборка.Количество);
	КонецЦикла;

	Возврат Результат;
	Строка = "{
	|	""Сумма"": 100,
	|	""Количество"": 200,
	|	""Наименование"": ""Тапки""
	|	}";
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	ДанныеОбъекта = ПрочитатьJSON(ЧтениеJSON);
	
	Результат = Новый Структура;
	Результат.Вставить("НаименованиеТовара", ДанныеОбъекта.Наименование);
	Результат.Вставить("СуммаВсегоТовара", ДанныеОбъекта.Сумма);

	Сообщить(НСтр("ru='Привет мир!';en='Hello world!';zh='你好世界!';es='¡Hola mundo!'"));
	


КонецФункции

#КонецОбласти

#КонецЕсли